Documents/ПланПереработкиПартии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПланПереработкиПартии</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПартияСырья</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегистрацияСырья</v8:Type>
					</Type>
				</Properties>
			</Attribute>
                        <TabularSection>
				<Properties>
					<Name>ЭтапыПереработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтапПереработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыПереработкиРуды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цех</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦехаФабрики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Участок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчасткиЦехов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
                                        <Attribute>
                                                <Properties>
                                                        <Name>ДатаВремяНачалаРабот</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
                                                </Properties>
                                        </Attribute>
                                        <Attribute>
                                                <Properties>
                                                        <Name>ДатаВремяОкончанияРабот</Name>
                                                        <Type>
                                                                <v8:Type>xs:dateTime</v8:Type>
                                                                <v8:DateQualifiers>
                                                                        <v8:DateFractions>DateTime</v8:DateFractions>
                                                                </v8:DateQualifiers>
                                                        </Type>
                                                </Properties>
                                        </Attribute>
                                        <Attribute>
                                                <Properties>
                                                        <Name>Продукция</Name>
                                                        <Type>
                                                                <v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
                                                        </Type>
                                                </Properties>
                                        </Attribute>
                                        <Attribute>
                                                <Properties>
                                                        <Name>ПлановоеКоличество</Name>
                                                        <Type>
                                                                <v8:Type>xs:decimal</v8:Type>
                                                                <v8:NumberQualifiers>
                                                                        <v8:Digits>15</v8:Digits>
                                                                        <v8:FractionDigits>3</v8:FractionDigits>
                                                                </v8:NumberQualifiers>
                                                        </Type>
                                                </Properties>
                                        </Attribute>
                                        <Attribute>
                                                <Properties>
                                                        <Name>ЕдиницаИзмерения</Name>
                                                        <Type>
                                                                <v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
                                                        </Type>
                                                </Properties>
                                        </Attribute>
                                </ChildObjects>
                        </TabularSection>
                </ChildObjects>
        </Document>
</MetaDataObject>

Documents/РегистрацияСырья.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РегистрацияСырья</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УникальныйНомерПартии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаданиеНаСмену.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
        <Document>
                <Properties>
                        <Name>ЗаданиеНаСмену</Name>
                        <Posting>Allow</Posting>
                </Properties>
                <ChildObjects>
                        <Attribute>
                                <Properties>
                                        <Name>ПартияСырья</Name>
                                        <Type>
                                                <v8:Type>cfg:DocumentRef.РегистрацияСырья</v8:Type>
                                        </Type>
                                </Properties>
                        </Attribute>
                        <Attribute>
                                <Properties>
                                        <Name>НомерПартии</Name>
                                        <Type>
                                                <v8:Type>xs:string</v8:Type>
                                                <v8:StringQualifiers>
                                                        <v8:Length>20</v8:Length>
                                                </v8:StringQualifiers>
                                        </Type>
                                </Properties>
                        </Attribute>
                        <Attribute>
                                <Properties>
                                        <Name>ЭтапПереработки</Name>
                                        <Type>
                                                <v8:Type>cfg:CatalogRef.ЭтапыПереработкиРуды</v8:Type>
                                        </Type>
                                </Properties>
                        </Attribute>
                        <Attribute>
                                <Properties>
                                        <Name>Участок</Name>
                                        <Type>
                                                <v8:Type>cfg:CatalogRef.УчасткиЦехов</v8:Type>
                                        </Type>
                                </Properties>
                        </Attribute>
                        <Attribute>
                                <Properties>
                                        <Name>ДатаВремяНачалаРабот</Name>
                                        <Type>
                                                <v8:Type>xs:dateTime</v8:Type>
                                                <v8:DateQualifiers>
                                                        <v8:DateFractions>DateTime</v8:DateFractions>
                                                </v8:DateQualifiers>
                                        </Type>
                                </Properties>
                        </Attribute>
                        <Attribute>
                                <Properties>
                                        <Name>ДатаВремяОкончанияРабот</Name>
                                        <Type>
                                                <v8:Type>xs:dateTime</v8:Type>
                                                <v8:DateQualifiers>
                                                        <v8:DateFractions>DateTime</v8:DateFractions>
                                                </v8:DateQualifiers>
                                        </Type>
                                </Properties>
                        </Attribute>
                        <Attribute>
                                <Properties>
                                        <Name>План</Name>
                                        <Type>
                                                <v8:Type>cfg:DocumentRef.ПланПереработкиПартии</v8:Type>
                                        </Type>
                                </Properties>
                        </Attribute>
                </ChildObjects>
        </Document>
</MetaDataObject>

Documents/ПланПереработкиПартии/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПартияСырьяПриИзменении(Элемент)
    // при смене партии пересчитываем плановые показатели
    РассчитатьПлан(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПереработкиЦехПриИзменении(Элемент)

    // обработка изменения цеха оставлена для дальнейших доработок
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПлан(Команда)

    Если Не ЗначениеЗаполнено(Объект.ПартияСырья) Тогда
        Сообщить("Не заполнена партия сырья.");
        Возврат;
    КонецЕсли;

    ДанныеПартии = ПолучитьДанныеПартии(Объект.ПартияСырья);
    Если ДанныеПартии = Неопределено Тогда
        Сообщить("Не удалось получить данные партии.");
        Возврат;
    КонецЕсли;

    ПредыдущееОкончание = Неопределено;

    Для Каждого Строка Из Объект.ЭтапыПереработки Цикл
        Строка.Продукция = ДанныеПартии.Номенклатура;
        Строка.ЕдиницаИзмерения = ДанныеПартии.ЕдиницаИзмерения;

        Коэффициент = КоэффициентВыхода(Строка.ЭтапПереработки);
        Строка.ПлановоеКоличество = ДанныеПартии.Вес * Коэффициент;

        Начало = Строка.ДатаВремяНачалаРабот;
        Если Не ЗначениеЗаполнено(Начало) Тогда
            Если ПредыдущееОкончание <> Неопределено Тогда
                Начало = ПредыдущееОкончание;
            Иначе
                Начало = Объект.Date;
            КонецЕсли;
            Строка.ДатаВремяНачалаРабот = Начало;
        КонецЕсли;

        ДлительностьЧасов = РассчитатьДлительностьВЧасах(ДанныеПартии.Вес, Строка.ЭтапПереработки);
        Строка.ДатаВремяОкончанияРабот = ДобавитьКДате(Начало, Окр(ДлительностьЧасов, 0, НаправлениеОкругления.ВБольшуюСторону), ВидИнтервала.Час);
        ПредыдущееОкончание = Строка.ДатаВремяОкончанияРабот;
    КонецЦикла;

    Элементы.ЭтапыПереработки.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаданияНаСмену(Команда)

    Сообщения = СоздатьЗаданияНаСменуНаСервере(Объект);
    Если Сообщения <> Неопределено Тогда
        Для Каждого ТекстСообщения Из Сообщения Цикл
            Сообщить(ТекстСообщения);
        КонецЦикла;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПартии(СсылкаПартии)

    Если Не ЗначениеЗаполнено(СсылкаПартии) Тогда
        Возврат Неопределено;
    КонецЕсли;

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ"+
        "|    РегистрацияСырья.Номенклатура,"+
        "|    РегистрацияСырья.Вес,"+
        "|    РегистрацияСырья.УникальныйНомерПартии"+
        "|ИЗ"+
        "|    Документ.РегистрацияСырья КАК РегистрацияСырья"+
        "|ГДЕ"+
        "|    РегистрацияСырья.Ссылка = &Ссылка";

    Запрос.УстановитьПараметр("Ссылка", СсылкаПартии);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();

    Если Выборка.Следующий() Тогда
        Данные = Новый Структура;
        Данные.Вставить("Номенклатура", Выборка.Номенклатура);
        Данные.Вставить("Вес", Выборка.Вес);
        Данные.Вставить("НомерПартии", Выборка.УникальныйНомерПартии);
        Единица = ПолучитьЕдиницуНоменклатуры(Выборка.Номенклатура);
        Данные.Вставить("ЕдиницаИзмерения", Единица);
        Возврат Данные;
    КонецЕсли;

    Возврат Неопределено;
КонецФункции

&НаСервере
Функция ПолучитьЕдиницуНоменклатуры(Номенклатура)
    Если Не ЗначениеЗаполнено(Номенклатура) Тогда
        Возврат Неопределено;
    КонецЕсли;

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ"+
        "|    Номенклатура.ЕдиницаИзмерения"+
        "|ИЗ"+
        "|    Справочник.Номенклатура КАК Номенклатура"+
        "|ГДЕ"+
        "|    Номенклатура.Ссылка = &Ссылка";

    Запрос.УстановитьПараметр("Ссылка", Номенклатура);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    Если Выборка.Следующий() Тогда
        Возврат Выборка.ЕдиницаИзмерения;
    КонецЕсли;

    Возврат Неопределено;
КонецФункции

&НаСервере
Функция РассчитатьДлительностьВЧасах(ВесПартии, ЭтапПереработки)

    Если ВесПартии = Неопределено Тогда
        Возврат 0;
    КонецЕсли;

    СкоростьВДень = 100;
    ПредставлениеЭтапа = НРег(Строка(ЭтапПереработки));
    Если Найти(ПредставлениеЭтапа, "циан") > 0 Или Найти(ПредставлениеЭтапа, "осад") > 0 Тогда
        СкоростьВДень = 50; // ограничение 40-60 тонн за 24 часа
    КонецЕсли;

    ДлительностьДней = ВесПартии / СкоростьВДень;
    Возврат ДлительностьДней * 24;
КонецФункции

&НаСервере
Функция КоэффициентВыхода(ЭтапПереработки)
    ПредставлениеЭтапа = НРег(Строка(ЭтапПереработки));
    Если Найти(ПредставлениеЭтапа, "зол") > 0 Или Найти(ПредставлениеЭтапа, "осад") > 0 Тогда
        Возврат 0.005; // 500 г с 100 тонн
    КонецЕсли;
    Возврат 1;
КонецФункции

&НаСервере
Функция УчастокЗанят(Участок, Начало, Конец)

    Если Не ЗначениеЗаполнено(Участок) Тогда
        Возврат Ложь;
    КонецЕсли;

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ ПЕРВЫЕ 1"+
        "|    ЗаданиеНаСмену.Ссылка"+
        "|ИЗ"+
        "|    Документ.ЗаданиеНаСмену КАК ЗаданиеНаСмену"+
        "|ГДЕ"+
        "|    ЗаданиеНаСмену.Участок = &Участок"+
        "|    И ЗаданиеНаСмену.ДатаВремяНачалаРабот <= &Конец"+
        "|    И ЗаданиеНаСмену.ДатаВремяОкончанияРабот >= &Начало";

    Запрос.УстановитьПараметр("Участок", Участок);
    Запрос.УстановитьПараметр("Начало", Начало);
    Запрос.УстановитьПараметр("Конец", Конец);

    Результат = Запрос.Выполнить();
    Возврат Не Результат.Пустой();
КонецФункции

&НаСервере
Функция СоздатьЗаданияНаСменуНаСервере(План)
    Сообщения = Новый Массив;

    Если Не ЗначениеЗаполнено(План.ПартияСырья) Тогда
        Сообщения.Добавить("Не заполнена партия сырья в плане.");
        Возврат Сообщения;
    КонецЕсли;

    ДанныеПартии = ПолучитьДанныеПартии(План.ПартияСырья);

    Для Каждого Строка Из План.ЭтапыПереработки Цикл
        Если Не ЗначениеЗаполнено(Строка.Участок) Тогда
            Сообщения.Добавить("Не заполнен участок в строке этапа.");
            Продолжить;
        КонецЕсли;

        Начало = Строка.ДатаВремяНачалаРабот;
        КонецРабот = Строка.ДатаВремяОкончанияРабот;

        Если УчастокЗанят(Строка.Участок, Начало, КонецРабот) Тогда
            Сообщения.Добавить("Участок " + Строка(Строка.Участок) + " уже зарезервирован на выбранное время.");
            Продолжить;
        КонецЕсли;

        НовыйДокумент = Документы.ЗаданиеНаСмену.СоздатьДокумент();
        НовыйДокумент.Date = ТекущаяДата();
        НовыйДокумент.ПартияСырья = План.ПартияСырья;
        Если ДанныеПартии <> Неопределено Тогда
            НовыйДокумент.НомерПартии = ДанныеПартии.НомерПартии;
        КонецЕсли;
        НовыйДокумент.ЭтапПереработки = Строка.ЭтапПереработки;
        НовыйДокумент.Участок = Строка.Участок;
        НовыйДокумент.ДатаВремяНачалаРабот = Начало;
        НовыйДокумент.ДатаВремяОкончанияРабот = КонецРабот;
        НовыйДокумент.План = План.Ссылка;
        НовыйДокумент.Записать();
    КонецЦикла;

    Возврат Сообщения;
КонецФункции
